{
  "HOME": "INÍCIO",
  "ABOUT": "SOBRE",
  "SERVICES": "SERVIÇOS",
  "SKILLS": "HABILIDADES",
  "MY WORK": "MEU TRABALHO",
  "CONTACT": "CONTATO",
  "FULL-STACK DEVELOPER": "DESENVOLVEDOR FULL-STACK",
  "I am a Developer, currently focused on the Web, completely dedicated to the studies and work I do.": "Sou um desenvolvedor, atualmente focado na Web, completamente dedicado aos estudos e ao trabalho que realizo.",
  "HIRE ME": "CONTRATE-ME",
  "Follow Me:": "Siga-me:",
  "I'm a ": "Eu sou um desenvolvedor de ",
  "-year-old developer, with a strong focus on web development. I am fully dedicated to continuous learning, and I specialize in building, maintaining, and enhancing interfaces and systems to meet the unique needs of your business. My passion for technology drives me to stay open to new challenges and constantly pursue knowledge and growth.": " anos de idade, com foco sólido em desenvolvimento web. Estou totalmente dedicado à aprendizagem contínua e especializo-me na construção, manutenção e aprimoramento de interfaces e sistemas para atender às necessidades exclusivas do seu negócio. Minha paixão pela tecnologia me impulsiona a permanecer aberto a novos desafios e a buscar constantemente conhecimento e crescimento.",
  "DOWNLOAD CV": "BAIXAR CURRÍCULO",
  "ABOUT ME": "SOBRE MIM",
  "Why should you hire me for your next or current project?": "Por que você deveria me contratar para seu próximo projeto ou projeto atual?",
  "Services": "Serviços",
  "What services do i offer": "Quais serviços eu ofereço",
  "Web Development": "Desenvolvimento Web",
  "I can build your new system, e-commerce, landing page, or whatever you need. Whether it's solving bugs, creating new solutions, or contributing to existing projects, I'm here to help.": "Posso construir seu novo sistema, e-commerce, landing page ou o que você precisar. Seja para resolver bugs, criar novas soluções ou contribuir para projetos existentes, estou aqui para ajudar.",
  "Creative Solutions": "Soluções Criativas",
  "Recognized potential in my dedication and need something out of the box? I'm always open to new business possibilities involving technology. Let's have a conversation!": "Reconheceu o potencial na minha dedicação e precisa de algo fora do comum? Estou sempre aberto a novas possibilidades de negócios envolvendo tecnologia. Vamos conversar!",
  "Revitalization": "Revitalização",
  "If you have any legacy code and are interested in modernizing it for improved performance, a better user experience, and potentially cost savings through optimizations, I'm willing to learn any language or framework to solve your problem.": "Se você tem algum código legado e está interessado em modernizá-lo para melhorar o desempenho, a experiência do usuário e, potencialmente, economizar custos por meio de otimizações, estou disposto a aprender qualquer linguagem ou framework para resolver o seu problema.",
  "Satisfied with your legacy project as it is but need a professional for general modifications? Invest in my time and expertise, and I'll gradually turn your ideas into reality.": "Satisfeito com seu projeto legado como está, mas precisa de um profissional para modificações gerais? Invista no meu tempo e expertise, e gradualmente transformarei suas ideias em realidade.",
  "MY PROGRESS SO FAR": "MEU PROGRESSO ATÉ AGORA",
  "My Skills": "Minhas Habilidades",
  "CHECK OUT MY EXPERIENCE": "CONFIRA MINHA EXPERIÊNCIA",
  "Professional Environment": "Ambiente Profissional",
  "Personal Projects": "Projetos Pessoais",
  "Freelance \nLanding page for tutorial videos an)d contact presentation.": "Freelance \nPágina de destino para vídeos tutoriais e apresentação de contato.",
  "Freelance\nRagnarok Zeny and Items E-commerce.": "Freelance\nRagnarok Zeny e Items E-commerce.",
  "Freelance\nI studied two versions of the Bling API (ERP) as the client aimed to develop a fully customized e-commerce platform, integrating and updating information through the Bling API. However, while already in development, after a certain evaluation of the APIs, the latest version proved to be incompatible with our requirements. On the other hand, the previous version, although meeting our requirements, was scheduled to cease operation in the middle of the year. Faced with this, we opted for the most viable solution, which involved using pre-built templates offered by NumveShop, a Bling partner. From this template, I made some specific adjustments through CSS.": "Freelance\nEstudei duas versões da API Bling (ERP) conforme o cliente visava desenvolver uma plataforma de e-commerce totalmente personalizada, integrando e atualizando informações por meio da API Bling. No entanto, durante o desenvolvimento, após uma avaliação das APIs, a versão mais recente mostrou-se incompatível com nossos requisitos. Por outro lado, a versão anterior, embora atendesse aos nossos requisitos, estava programada para encerrar as operações no meio do ano. Diante disso, optamos pela solução mais viável, que envolvia o uso de modelos pré-construídos oferecidos pela NumveShop, parceira da Bling. A partir desse modelo, fiz alguns ajustes específicos por meio de CSS.",
  "Freelance\nI developed a landing page with a focus on responsiveness, designing according to client preferences, also creating thumbnails and editing videos.": "Freelance\nDesenvolvi uma página de destino com foco em responsividade, projetando de acordo com as preferências do cliente, também criando miniaturas e editando vídeos.",
  "Freelance\nDevelopment and customization of features on demand in mobile apps built with React Native, within an ecosystem that includes a translation system, shipping functionality, notifications, sales, barcode scanning and recording, use of a currency conversion API, product registration, services, real estate, and various others. The project utilizes React Native with TypeScript, Styled-Components, and the backend is built with PHP.": "Freelance\nDesenvolvimento e personalização de recursos sob demanda em aplicativos móveis construídos com React Native, dentro de um ecossistema que inclui um sistema de tradução, funcionalidade de envio, notificações, vendas, leitura e gravação de códigos de barras, uso de uma API de conversão de moeda, registro de produtos, serviços, imóveis e vários outros. O projeto utiliza React Native com TypeScript, Styled-Components, e o backend é construído com PHP.",
  "Freelance\nDevelopment and maintenance of an Ecommerce platform for religious articles, including inventory and product management through an internal system that I developed. Key technologies used: NextJS (React), TypeScript (JavaScript), and TailwindCSS.": "Freelance\nDesenvolvimento e manutenção de uma plataforma de e-commerce para artigos religiosos, incluindo gerenciamento de estoque e produtos por meio de um sistema interno que desenvolvi. Principais tecnologias utilizadas: NextJS (React), TypeScript (JavaScript) e TailwindCSS.",
  "Freelance\nI worked on the successful migration of two projects to cutting-edge technologies. The first project, originally built with Node.js, JavaScript, jQuery, and HTML, and the second one with Preact, were modernized with TypeScript and Next.js along with Serverless Functions, as per the client's request.": "Freelance\nTrabalhei na migração bem-sucedida de dois projetos para tecnologias de ponta. O primeiro projeto, originalmente construído com Node.js, JavaScript, jQuery e HTML, e o segundo com Preact, foram modernizados com TypeScript e Next.js, juntamente com Funções Serverless, conforme pedido do cliente.",
  "Image Optimizer.\nIt does optimize your images by formating it to .webp and limiting It's max resolution to 1080px. Just paste it inside some folder and execute it, it will optimize all images that aren't .webp from this folder and its subfolders.": "Otimizador de Imagens.\nEle otimiza suas imagens formatando-as para .webp e limitando a resolução máxima para 1080px. Basta colá-lo dentro de alguma pasta e executá-lo, ele otimizará todas as imagens que não são .webp desta pasta e de suas subpastas.",
  "Imageboard that generates random cat pictures for your posts.": "Imageboard que gera imagens aleatórias de gatos para suas postagens.",
  "E-commerce prototype.": "Protótipo de E-commerce.",
  "Discover the world's finest coffeee beans and brew your perfect cup of coffeee. Ecommerce-like website.": "Descubra os melhores grãos de café do mundo e faça a sua xícara de café perfeita. Site semelhante a um E-commerce.",
  "Product and Order Manager for a Bakery.": "Gerenciador de Produtos e Pedidos para uma Padaria.",
  "Grade Manager for Teachers and Principals.\nLogins at: \"/api/showLogins\", every pass is \"asd\"": "Gerenciador de Notas para Professores e Diretores.\nLogins em: \"/api/showLogins\", cada senha é \"asd\"",
  "This website, like, literally.": "Este site, tipo, literalmente.",
  "I want to hear from you": "Eu quero ouvir de você",
  "Contact Me": "Contate-me",
  "Call Me:": "Me Ligue:",
  "Email Me:": "Envie-me um Email:",
  "Location": "Localização",
  "All rights reserved | Made with ❤ by Vitor Fernandes": "Todos os direitos reservados | Feito com ❤ por Vitor Fernandes"
}